Revit 2027 API
StructuralFramingUtils.SetEndReference Method
 Sets the end reference of a framing element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetEndReference(
	FamilyInstance familyInstance,
	int end,
	Reference pick
)
Public Shared Sub SetEndReference (
	familyInstance As FamilyInstance,
	end As Integer,
	pick As Reference
)
public:
static void SetEndReference(
	FamilyInstance^ familyInstance,
	int end,
	Reference^ pick
)
static member SetEndReference :
        familyInstance : FamilyInstance *
        end : int *
        pick : Reference -> unit
Parameters
familyInstance FamilyInstance
 The FamilyInstance, which must be of a structural framing category, non-concrete and joined.
end Int32
 The index of the end (0 for the start, 1 for the end).
pick Reference
 The reference to set to the given end.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  end must be 0 or 1.
ArgumentsInconsistentException |  The input familyInstance is not of a structural framing category or is concrete or is not joined at given end and cannot have an end reference set. -or- The input pick cannot be set as the end reference for the given end of the structural framing element.
Remarks
 The setback value will be changed as a result of the removal.
See Also
Reference
StructuralFramingUtils Class
Autodesk.Revit.DB.Structure Namespace